TempusFugit05/the-watch-project/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.2.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_MIPI_DISPLAY_WIDTH=240
CONFIG_MIPI_DISPLAY_HEIGHT=320
CONFIG_MIPI_DISPLAY_INVERT=y
CONFIG_MIPI_DCS_ADDRESS_MODE_BGR_SELECTED=y
CONFIG_ESP32_VSPI_HOST_SELECTED=y
CONFIG_MIPI_DISPLAY_PIN_DC=13
CONFIG_MIPI_DISPLAY_PIN_BL=-1
